<img src="https://raw.githubusercontent.com/andre-marcos-perez/ebac-course-utils/main/media/logo/newebac_logo_black_half.png" alt="ebac-logo">

Carregue as bibliotecas Python de manipulação de dados.

In [80]:
import pandas as pd
import seaborn as sns

Carregue os dados de **voos** (*flights*) e responda as perguntas abaixo:

In [81]:
flights = sns.load_dataset('flights')

In [82]:
flights.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [83]:
flights.tail()

     year month  passengers
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

**Responda:**
 - Qual é a granularidade temporal da base de dados: **?**

 > O menor intervalo de tempo entre coleta de dados está localizado na coluna **month**.  
 > **A granularidade é mensal.**

**Responda:**
 - Qual é o intervalo de tempo (min/max): **?**

 > Inicio da coleta de dados começa em **Janeiro de 1949** e termina em **Dezembro de 1960.**

Tranforme o texto da coluna `month` para sua representação numérica, exemplo: `Jan` para `1` e `Dec` para `12`.

In [84]:
flights['month'] = pd.to_datetime(flights['month'], format='%b').dt.month

flights.head()

   year  month  passengers
0  1949      1         112
1  1949      2         118
2  1949      3         132
3  1949      4         129
4  1949      5         121

Crie uma chave temporal `year-month` no formato `YYYY-MM` através da concatenação das colunas `year` e `month`, exemplo: `1949-01`.

In [85]:
flights['year-month'] = pd.to_datetime(flights.year.astype(str) + '-' + flights.month.astype(str)).dt.to_period('M')

flights.head()

   year  month  passengers year-month
0  1949      1         112    1949-01
1  1949      2         118    1949-02
2  1949      3         132    1949-03
3  1949      4         129    1949-04
4  1949      5         121    1949-05

Reordene as colunas da seguinte forma: `year-month`, `year`, `month` e `passengers`.

In [86]:
flights = flights[['year-month', 'year', 'month', 'passengers']]

flights.head()

  year-month  year  month  passengers
0    1949-01  1949      1         112
1    1949-02  1949      2         118
2    1949-03  1949      3         132
3    1949-04  1949      4         129
4    1949-05  1949      5         121

Persista o DataFrame em um arquivo com o nome `flights.csv`, no formato CSV. Garanta que o índice será descartado.

In [87]:
flights.to_csv('flights.csv', index=False)

## 3\. Dashboard

 - Link

 Dashboad foi construido na resolução de **1920x1080 FullHD** - Para melhor Visualição no canto superior direito da página nos 3 pontinhos **...** click em **"Apresentar"**

 > Link do relatório: **https://lookerstudio.google.com/reporting/484f3895-fde0-4702-8f20-076e200ddd98/page/MQRdE**

---